# PtOnLine

## Description
Determines if a point is on a line.

```pascal
FUNCTION PtOnLine(
				pt        : VECTOR;
				begPt     : VECTOR;
				endPt     : VECTOR;
				tolerance : REAL) : BOOLEAN;
```

```python

def vs.PtOnLine(pt, begPt, endPt, tolerance):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|pt|VECTOR||
|begPt|VECTOR||
|endPt|VECTOR||
|tolerance|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation